{"<PAD>": 0, "<UNK>": 1, "[wildcard]": 2, "out": 3, "process": 4, "of": 5, "memory:": 6, "killed": 7, "uid=": 8, "euid=": 9, "authentication": 10, "logname=": 11, "tty=": 12, "ruser=": 13, "nodevssh": 14, "failure;": 15, "at": 16, "connection": 17, "from": 18, "user=": 19, "user": 20, "for": 21, "session": 22, "unknown": 23, "rhost=": 24, "check": 25, "pass;": 26, "by": 27, "opened": 28, "closed": 29, "device": 30, "node": 31, "succeeded": 32, "on": 33, "with": 34, "creating": 35, "system_u:": 36, "startup": 37, "listening": 38, "exited": 39, "or": 40, "alert": 41, "abnormally": 42, "pid=": 43, "removing": 44, "interface": 45, "ipv4": 46, "ttloop:": 47, "eth0:": 48, "dev=": 49, "system_r:": 50, "denied": 51, "peer": 52, "{": 53, "}": 54, "avc:": 55, "scontext=": 56, "tcontext=": 57, "tclass=": 58, "invalid": 59, "irq": 60, "loginuid=": 61, "is": 62, "no": 63, "object_r:": 64, "shutdown": 65, "character": 66, "syscall=": 67, "exit=": 68, "items=": 69, "gid=": 70, "suid=": 71, "fsuid=": 72, "egid=": 73, "sgid=": 74, "fsgid=": 75, "order:": 76, "died:": 77, "incomplete": 78, "multibyte": 79, "wide": 80, "exe=": 81, "driver": 82, "do_page_fault+0x0/0x446": 83, "failed": 84, "name=": 85, "mode:": 86, "page": 87, "timed": 88, "registered": 89, "allocation": 90, "failure.": 91, "call": 92, "trace:": 93, "initialized": 94, "ino=": 95, "found": 96, "not": 97, "cupsd": 98, "httpd:": 99, "do_page_fault+0x12f/0x446": 100, "[ext3]": 101, "read:": 102, "item=": 103, "version": 104, "schedule+0x3ed/0x44d": 105, "inode=": 106, "=": 107, "kernel": 108, "starting": 109, "hash": 110, "table": 111, "pci:": 112, "pci": 113, "bluetooth:": 114, "selinux:": 115, "seconds": 116, "and": 117, "protocol": 118, "put_user_size+0x29/0x2d": 119, "bios": 120, "detected": 121, "net:": 122, "family": 123, "new": 124, "file": 125, "longer": 126, "smartd": 127, "read_swap_cache_async+0x41/0x84": 128, "getpeername": 129, "ftpd:": 130, "transport": 131, "endpoint": 132, "connected": 133, "restart.": 134, "to": 135, "bytes": 136, "core": 137, "entries:": 138, "cache": 139, "socket": 140, "handle_mm_fault+0x9d/0xe2": 141, "disabled": 142, "httpd": 143, "after": 144, "hda2": 145, "data": 146, "c": 147, "initializing": 148, "intel": 149, "using": 150, "usbcore:": 151, "bus": 152, "netfilter": 153, "time": 154, "started": 155, "cd-rom": 156, "mode.": 157, "md:": 158, "parport0:": 159, "layer": 160, "enabled": 161, "ext3-fs:": 162, "login": 163, "do_no_page+0xa1/0x235": 164, "handle_mm_fault+0x71/0xe2": 165, "type": 166, "hda:": 167, "reset": 168, "vm:": 169, "killing": 170, "in": 171, "port": 172, "***": 173, "info": 174, "couldnt": 175, "kerberos": 176, "path=": 177, "linux": 178, "zone:": 179, "pages": 180, "lifo": 181, "batch:": 182, "registering": 183, "cache:": 184, "revision": 185, "plug": 186, "routing": 187, "agpgart:": 188, "a": 189, "pio": 190, "controller": 191, "hdc:": 192, "configuration": 193, "device:": 194, "*": 195, "usb": 196, "bind": 197, "mounted": 198, "hub": 199, "internal": 200, "ver": 201, "rfcomm": 202, "service": 203, "sync": 204, "kernel_t": 205, "klogd": 206, "ps/2": 207, "root": 208, "swapin_readahead+0x2c/0x47": 209, "do_swap_page+0x5d/0x1f9": 210, "do_page_cache_readahead+0xa3/0x101": 211, "filemap_nopage+0x119/0x26d": 212, "daemon": 213, "bad": 214, "error": 215, "dev": 216, "xinetd": 217, "gpm": 218, "named": 219, "gethostbyname": 220, "recalc_task_prio+0x141/0x14c": 221, "dma": 222, "max": 223, "sendmail": 224, "get": 225, "client": 226, "follow_page+0xda/0xe5": 227, "uses": 228, "command": 229, "status": 230, "warning:": 231, "cant": 232, "address:": 233, "more": 234, "started.": 235, "code": 236, "-": 237, "drive": 238, "fs": 239, "ip_tables:": 240, "team": 241, ":": 242, "software": 243, "caused": 244, "abort": 245, "stopping": 246, "do_swap_page+0x64/0x1f9": 247, "ram": 248, "highmem": 249, "cpu": 250, "order": 251, "available": 252, "security": 253, "failed.": 254, "failure": 255, "capability": 256, "cpu:": 257, "machine": 258, "fpu": 259, "checking": 260, "subsystem": 261, "acpi:": 262, "play": 263, "probing": 264, "hardware": 265, "netlink": 266, "vfs:": 267, "an": 268, "use": 269, "agp": 270, "sdpd": 271, "ports": 272, "i/o": 273, "revision:": 274, "ich:": 275, "bm-dma": 276, "settings:": 277, "io": 278, "/etc/smartd.conf": 279, "/dev/hda": 280, "adding": 281, "scsi": 282, "background": 283, "mouse": 284, "serio:": 285, "image": 286, "initrd": 287, "freeing": 288, "freed": 289, "autorun": 290, "kjournald": 291, "starting.": 292, "commit": 293, "interval": 294, "filesystem": 295, "ordered": 296, "host": 297, "uhci_hcd": 298, "ext3": 299, "journal": 300, "microcode:": 301, "already": 302, "pc-style": 303, "[pcspp": 304, "tristate": 305, "epp]": 306, "floppy": 307, "donald": 308, "becker": 309, "others.": 310, "www.scyld.com/network/vortex.html": 311, "3com": 312, "tornado": 313, "vers": 314, "hci": 315, "l2cap": 316, "lp0:": 317, "ntpd": 318, "add": 319, "channel": 320, "notify": 321, "question": 322, "section": 323, "contains": 324, "soa": 325, "rw_vm+0x1ce/0x1ea": 326, "log": 327, "hooks": 328, "sm-client": 329, "imps2:": 330, "auto-detected": 331, "intellimouse": 332, "generic_file_aio_write+0x69/0x7c": 333, "ext3_file_write+0x19/0x88": 334, "do_sync_write+0x68/0x9d": 335, "do_acct_process+0x283/0x297": 336, "acct_process+0x15/0x1f": 337, "do_exit+0x9f/0x2e3": 338, "setsockopt": 339, "anonymous": 340, "exiting": 341, "test": 342, "find_or_create_page+0x39/0x70": 343, "grow_dev_page+0x27/0xc3": 344, "__getblk_slow+0xa1/0xcb": 345, "__getblk+0x25/0x2b": 346, "ext3_reserve_inode_write+0x21/0x81": 347, "ext3_mark_inode_dirty+0x11/0x27": 348, "journal_start+0x78/0x9e": 349, "[jbd]": 350, "ext3_dirty_inode+0x4f/0x5f": 351, "__mark_inode_dirty+0x20/0xca": 352, "inode_update_time+0x8e/0x96": 353, "generic_file_aio_write_nolock+0x302/0x84e": 354, "such": 355, "username": 356, "portmap": 357, "rpc.statd": 358, "system": 359, "apmd": 360, "will": 361, "filesystem.": 362, "info:": 363, "spamd": 364, "privoxy": 365, "crond": 366, "xfs": 367, "atd": 368, "messagebus": 369, "squid": 370, "parent:": 371, "child": 372, "snmpd": 373, "received": 374, "failures;": 375, "ext3_get_inode_loc+0x4f/0x201": 376, "sysadm_r:": 377, "ftp": 378, "servicesshd": 379, "ignoring": 380, "retries;": 381, ">": 382, "signal": 383, "mempool_alloc+0x5d/0xf6": 384, "vt_console_print+0x64/0x28f": 385, "sendmail:": 386, "genfs_contexts": 387, "syslogd": 388, "up": 389, "configured": 390, "authenticate": 391, "shutting": 392, "__wake_up+0xe/0x16": 393, "page_cache_read+0x2a/0x7a": 394, "source": 395, "/proc/kmsg": 396, "audit:": 397, "console": 398, "line": 399, "[]": 400, "tty2": 401, "schedule+0x3f/0x44d": 402, "__wake_up_common+0x2f/0x50": 403, "bhcompile@bugs.build.redhat.com": 404, "gcc": 405, "red": 406, "hat": 407, "sat": 408, "may": 409, "edt": 410, "bios-provided": 411, "physical": 412, "map:": 413, "lowmem": 414, "zapping": 415, "low": 416, "mappings.": 417, "totalpages:": 418, "dmi": 419, "present.": 420, "acpi": 421, "because": 422, "your": 423, "too": 424, "old": 425, "you": 426, "can": 427, "enable": 428, "it": 429, "acpi=": 430, "force": 431, "built": 432, "irqbalance": 433, "line:": 434, "ro": 435, "root=": 436, "label=": 437, "/": 438, "rhgb": 439, "quiet": 440, "mapped": 441, "cpu#0": 442, "irqstacks": 443, "hard=": 444, "soft=": 445, "pid": 446, "mhz": 447, "processor.": 448, "tsc": 449, "high-res": 450, "timesource": 451, "console:": 452, "colour": 453, "vga+": 454, "reserved": 455, "init": 456, "calibrating": 457, "delay": 458, "bogomips": 459, "scaffold": 460, "initializing.": 461, "permissive": 462, "mode": 463, "there": 464, "framework": 465, "register_security": 466, "capabilities": 467, "the": 468, "selinux_register_security:": 469, "module": 470, "lsm": 471, "dentry": 472, "inode-cache": 473, "mount-cache": 474, "i": 475, "d": 476, "architecture": 477, "supported.": 478, "reporting": 479, "cpu#0.": 480, "pentium": 481, "iii": 482, "stepping": 483, "fast": 484, "save": 485, "restore...": 486, "unmasked": 487, "simd": 488, "exception": 489, "support...": 490, "hlt": 491, "instruction...": 492, "ok.": 493, "posix": 494, "conformance": 495, "testing": 496, "unifix": 497, "entry": 498, "0xfc0ce": 499, "last": 500, "bus=": 501, "mtrr:": 502, "interpreter": 503, "support": 504, "adam": 505, "belay": 506, "rpc.idmapd": 507, "entries": 508, "acpi-pci": 509, "random": 510, "generator:": 511, "transparent": 512, "bridge": 513, "router": 514, "piix/ich": 515, "flags": 516, "total": 517, "hugetlb": 518, "allocated": 519, "quotas": 520, "dquot_6.5.1": 521, "dquot-cache": 522, "cryptographic": 523, "pci_hotplug:": 524, "hot": 525, "version:": 526, "scanning": 527, "pnp": 528, "cards...": 529, "isapnp:": 530, "&": 531, "real": 532, "clock": 533, "agpgart": 534, "dave": 535, "e": 536, "chipset.": 537, "maximum": 538, "main": 539, "memory": 540, "hcid": 541, "video": 542, "ram.": 543, "setting": 544, "aperture": 545, "@": 546, "serial:": 547, "$revision:": 548, "$": 549, "sharing": 550, "ramdisk": 551, "initialized:": 552, "disks": 553, "size": 554, "blocksize": 555, "multi-platform": 556, "e-ide": 557, "mounting": 558, "filesystems:": 559, "ide:": 560, "assuming": 561, "speed": 562, "modes;": 563, "override": 564, "idebus=": 565, "xx": 566, "ide": 567, "slot": 568, "apm": 569, "chipset": 570, "native": 571, "probe": 572, "irqs": 573, "later": 574, "hdb:": 575, "automount": 576, "hdd:": 577, "disk": 578, "copyright": 579, "bruce": 580, "allen": 581, "scheduler": 582, "http:": 583, "//smartmontools.sourceforge.net/": 584, "samsung": 585, "cd/dvd-rom": 586, "parsed.": 587, "udma": 588, "blacklisted": 589, "charge:": 590, "-1%": 591, "database.": 592, "size:": 593, "capable.": 594, "\"monitor\"": 595, "list.": 596, "sectors": 597, "mb": 598, "chs=": 599, "udma66": 600, "monitoring": 601, "ata": 602, "devices": 603, "hda3": 604, "ide-floppy": 605, "mice:": 606, "common": 607, "all": 608, "mice": 609, "aux": 610, "imps/2": 611, "logitech": 612, "wheel": 613, "kbd": 614, "input:": 615, "translated": 616, "set": 617, "keyboard": 618, "md": 619, "max_md_devs=": 620, "md_sb_disks=": 621, "ip:": 622, "buckets": 623, "4kbytes": 624, "tcp:": 625, "tables": 626, "established": 627, "ipsec": 628, "if": 629, "initramfs...it": 630, "isnt": 631, "cpio": 632, "magic;": 633, "looks": 634, "like": 635, "raid": 636, "arrays.": 637, "done.": 638, "compressed": 639, "block": 640, "ext2": 641, "recovery": 642, "unused": 643, "privacy": 644, "extensions": 645, "ipv6": 646, "over": 647, "tunneling": 648, "universal": 649, "uhci": 650, "base": 651, "assigned": 652, "number": 653, "device-mapper:": 654, "4.1.0-ioctl": 655, "initialised:": 656, "dm@uk.sistina.com": 657, "cdrom:": 658, "open": 659, "swap": 660, "/dev/hda3.": 661, "priority:": 662, "extents:": 663, "microcode": 664, "update": 665, "driver:": 666, "<tigran@veritas.com>": 667, "cpu0": 668, "current=": 669, "suitable": 670, "drives:": 671, "semiconductor": 672, "`syslogd": 673, "so_bsdcompat": 674, "manager": 675, "tty": 676, "parport0": 677, "polling.": 678, "service:": 679, "services/stream": 680, "disabling": 681, "address": 682, "errno": 683, "telnet": 684, "deactivated.": 685, "libwrap": 686, "loadavg": 687, "options": 688, "compiled": 689, "in.": 690, "working:": 691, "services": 692, "loading": 693, "/etc/privoxy/config:": 694, "successfully.": 695, "htt": 696, "anacron": 697, "-u": 698, "-t": 699, "/var/named/chroot": 700, "/etc/named.conf": 701, "lo": 702, "eth0": 703, "net-snmp": 704, "thu": 705, "mar": 706, "est": 707, "usec": 708, "/var/lib/ntp/drift": 709, "configure:": 710, "keyword": 711, "\"authenticate\"": 712, "ignored": 713, "running": 714, "rsyncd": 715, "mdadm": 716, "mdmpd": 717, "stratum=": 718, "descriptor": 719, "comsat": 720, "has": 721, "been": 722, "select": 723, "reported": 724, "ebadf": 725, "but": 726, "descriptors": 727, "were": 728, "permission": 729, "replay": 730, "null": 731, "records": 732, "user_u:": 733, "root:": 734, "sgpuser@home.com": 735, "network": 736, "parameters:": 737, "interface:": 738, "write": 739, "runtime.": 740, "unregistering": 741, "-term": 742, "call_console_drivers+0xbe/0xe3": 743, "filemap_nopage+0x182/0x26d": 744, "dir": 745, "down": 746, ".": 747, "read": 748, "get_user_size+0x30/0x57": 749, "file_t": 750, "ip_tos:": 751, "operation": 752, "supported": 753, "readonly": 754, "logging": 755, "proc": 756, "stopped.": 757, "terminating.": 758, "open/dev/pts/0:": 759, "directory": 760, "vt_console_print+0x0/0x28f": 761, "__call_console_drivers+0x36/0x42": 762, "do_wp_page+0x97/0x21c": 763, "sys_rt_sigaction+0x6b/0x80": 764, "d_instantiate+0x3f/0x42": 765, "sys_rt_sigprocmask+0x87/0x9a": 766, "transition": 767, "sids": 768, "ramfs_t": 769, "create": 770, "/bin/bash": 771, "required": 772, "access": 773, "be": 774, "during": 775, "recovery.": 776, "complete.": 777, "kernel.core_uses_pid": 778, "snmp": 779, "packets": 780, "reboot": 781, "switching": 782, "runlevel:": 783, "jserver": 784, "irw_killserver:": 785, "cannaserver": 786, "end": 787, "server:": 788, "sshd": 789, "terminated": 790, "exit": 791, "term": 792, "stop": 793, "signal...": 794, "down...": 795, "exiting...": 796, "saving": 797, "seed:": 798, "password": 799, "proc_dointvec+0x11/0x15": 800, "do_proc_dointvec_conv+0x0/0x36": 801, "check_free_space+0x1b5/0x1cb": 802, "search": 803, "devpts_t": 804, "sysadm_t": 805, "terminating": 806, "caught": 807, "un-registering": 808, "exiting.": 809, "do_rw_proc+0x79/0x8d": 810, "invalidate_inode_buffers+0x9/0x33": 811, "__print_symbol+0x35/0x121": 812, "do_wp_page+0xcb/0x21c": 813, "handle_mm_fault+0xbc/0xe2": 814, "xattr": 815, "fifo_file": 816, "chr_file": 817, "1f.2/usb1/bnumconfigurations": 818, "/dev/log": 819, "/proc/sys/kernel/modprobe": 820, "/dev/pts/1": 821, "hda2:": 822, "orphan": 823, "fd": 824, "[": 825, "]": 826, "rootuid=": 827, "rsync": 828, "illegal": 829, "^[[60g[": 830, "net.ipv4.conf.default.rp_filter": 831, "kernel.sysrq": 832, "timeout": 833, "__fput+0xb3/0xd1": 834, "input_unregister_device+0xd/0xc1": 835, "security:": 836, "labeling": 837, "task": 838, "/usr/bin/rhgb": 839, "rhgb-socket": 840, "sock_file": 841, "sysfs_t": 842, "/sys//devices/pci0000:": 843, "/dev/mapper/control": 844, "/sbin/killall5": 845, "/usr/bin/gdm-binary": 846, ".gdmfifo": 847, "/usr/sbin/sshd": 848, "cleanup": 849, "inodes": 850, "deleted": 851, "[;;]": 852, "connecting": 853, "request": 854, "closing": 855, "nf": 856, "tty2:": 857, "name": 858, "wall:": 859, "broadcasted": 860, "lines": 861, "chars": 862, "hung": 863, "probable": 864, "port-scan": 865, "rsync:": 866, "unexpectedly": 867, "so": 868, "far": 869, "error:": 870, "stream": 871, "connect": 872, "[smux_accept]": 873, "accepted": 874, "unable": 875, "client!": 876, "dma_timer_expiry:": 877, "retry": 878, "waiting": 879, "timeout:": 880, "status=": 881, "busy": 882, "ready": 883, "ide0:": 884, "reset:": 885, "success": 886, "spurious": 887, "interrupt:": 888, "irq7.": 889, "do_swap_page+0x1d3/0x1f9": 890, "generic_file_aio_write_nolock+0x4fe/0x84e": 891, "module_text_address+0x3a/0x5d": 892, "printk:": 893, "messages": 894, "suppressed.": 895, "clear_page_tables+0x7c/0x8f": 896, "free_pgtables+0x76/0x7b": 897, "unmap_region+0x80/0xaa": 898, "unmap_vma_list+0xe/0x17": 899, "sys_setuid+0xdd/0xe9": 900, "master": 901, "rebooting...": 902, "tty3": 903, "[\\\\]": 904, "audit=": 905, "initialization": 906, "users": 907, "roles": 908, "types": 909, "bools": 910, "classes": 911, "rules": 912, "completing": 913, "initialization.": 914, "existing": 915, "superblocks.": 916, "mqueue": 917, "hugetlbfs": 918, "/sbin/init": 919, "initctl": 920, "/proc/sys/net/econet": 921, "add_name": 922, "/usr/x11r6/bin/xorg": 923, "xfree86.0.log": 924, "execute": 925, "/dev/mem": 926, "/dev/ptmx": 927, "/usr/lib/vte/gnome-pty-helper": 928, "/proc/sys/net/ipv4/ip_forward": 929, "getattr": 930, "/sys/devices/pci0000:": 931, "/proc/bus/usb/devices": 932, "/sbin/minilogd": 933, "/sbin/nash": 934, "control": 935, "/proc/sys/kernel/hotplug": 936, "/usr/sbin/kudzu": 937, "lnk_file": 938, "/sys/bus/pci/devices/0000:": 939, "0c.0/resource": 940, "/proc/sys/dev/parport": 941, "/proc/sys/dev/parport/parport0/autoprobe": 942, "/udev/fd0": 943, "ioctl": 944, "/sbin/arping": 945, "socket:": 946, "packet_socket": 947, "/proc/net/rpc/nfs4.idtoname/channel": 948, "rpc_pipefs_t": 949, "pam_check_access": 950, "does": 951, "have": 952, "proper": 953, "access:": 954, "/bin/su": 955, "stat": 956, "/proc/2091/exe": 957, "/udev/vcsa5": 958, "unlink": 959, "/var/gdm/.gdmfifo": 960, "warning!": 961, "could": 962, "relabel": 963, "relabeling.": 964}